# IsFilterApplied Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..IsFilterApplied Method
View Class See Also
---
Indicates if a filter is applied to the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsFilterApplied(
	ElementId filterElementId
)
```

Visual Basic
---
```text
Public Function IsFilterApplied ( _
	filterElementId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsFilterApplied(
	ElementId^ filterElementId
)
```

# ### Parameters
filterElementId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the filter.
# ### Return Value
True if the filter is applied to the view, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | ElementId is not associated with a FilterElement. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

# See Also
View Class
Autodesk.Revit.DB Namespace